---
kind: property
id: P:Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.ProfileMatch
source: html/d942aaf3-8ad2-2c28-4f67-3c5252213b55.htm
---
# Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.ProfileMatch Property

Determines how two profiles match.

## Syntax (C#)
```csharp
public PartEdgeConditionOrientation ProfileMatch { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration